[net]
batch=128
subdivisions=1
height=32
width=32
channels=3
max_crop=32
min_crop=32

hue=.1
saturation=.75
exposure=.75

learning_rate=0.1
policy=poly
power=4
max_batches = 50000
momentum=0.9
decay=0.0005

[convolutional]
filters=6
size=5
stride=1
pad=0
activation=relu

[maxpool]
size=2
stride=2
padding=0

[convolutional]
filters=16
size=5
stride=1
pad=0
activation=relu

[maxpool]
size=2
stride=2
padding=0

[connected]
output=120
activation=relu

[connected]
output=84
activation=relu

[connected]
output=10
activation=relu

[softmax]
